#--coding: utf-8 --
#Date:20170828
#Title:ex22 到现在你学到了哪些东西

#引用网址：http://old.sebug.net/paper/books/LearnPythonTheHardWay/

# 首先，回到你的每一个习题的脚本里，把你碰到的每一个词和每一个符号（symbol，character的别名）写下来。确保你的符号列表是完整的。

# 下一步，在每一个关键词和字符后面写出它的名字，并且说明它的作用。如果你在书里找不到符号的名字，就上网找一下。如果你不知道某个关键字或者符号的作用，就回到用到该字符的章节通读一下，并且在脚本中测试一下这个字符的用处。

# 你也许会碰到一些横竖找不到答案的东西，只要把这些记在列表里，它可以提示你让你知道还有哪些东西不懂，等下次碰到的时候，你就不会轻易跳过了。

# 你的列表做好以后，再花几天时间重写一遍这份列表，确认里边的东西都是正确的。你可能觉得这很无聊，不过你还是需要坚持完成任务。

# 等你记住了这份列表中的所有内容，就试着把这份列表默写一遍。如果发现自己漏掉或者忘记了某些内容，就回去再记一遍。

#自己总结：
#1.回顾习题01到习题21的所有习题，建一个表格，分三行，分别是符号，符号名称，符号作用。
#2.打印出来，看看。
#3.过几天，尝试背出来，可以列出符号，背出名称和作用。
